Revit 2027 API
RebarInSystem.GetDistributionPath Method
 The distribution path of a rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Line GetDistributionPath()
Public Function GetDistributionPath As Line
public:
Line^ GetDistributionPath()
member GetDistributionPath : unit -> Line
Return Value
Line
 A line beginning at (0, 0, 0) and representing the direction and length of the set.
See Also
Reference
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace